export const QArray =
    [
        {
            question: "Часто ли вы испытываете тягу к новым впечатлениям, к тому чтобы отвлечься, испытать сильные ощущения?",
            Yes: {
                ext: 1,
                neur: 0,
                lies:0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Часто ли вы чувствуете, что нуждаетесь в друзьях, которые могут вас понять, одобрить или посочувствовать?",
            Yes: {
                ext: 0,
                neur: 1,
                lies:0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Считаете ли вы себя беззаботным человеком?",
            Yes: {
                ext: 1,
                neur: 0,
                lies:0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Очень ли трудно вам отказываться от своих намерений?",
            Yes: {
                ext: 0,
                neur: 1,
                lies:0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Обдумываете ли вы свои дела не спеша и предпочитаете подождать, прежде чем действовать?",
            Yes: {
                ext: 0,
                neur: 0,
                lies:0
            },
            No: {
                ext: 1,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Всегда ли вы сдерживаете свои обещания, даже если вам это невыгодно?",
            Yes: {
                ext: 0,
                neur: 0,
                lies:1
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Часто ли у вас бывают спады и подъемы настроения?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Быстро ли вы обычно действуете и говорите, не затрачиваете ли много времени на обдумывание?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Возникало ли у вас когда-нибудь чувство, что вы несчастны, хотя никакой серьезной причины на это не было?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Верно ли, что 'на спор' вы способны решиться на все?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Смущаетесь ли вы, когда хотите познакомиться с человеком противоположного пола, который вам симпатичен?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Бывает ли когда-нибудь, что, разозлившись, вы выходите из себя?",
            Yes: {
                ext: 0,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 1
            }
        },
        {
            question: "Часто ли действуете необдуманно, под влиянием момента?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Часто ли вас беспокоят мысли о том, что вам не следовало чего-либо делать или говорить?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Предпочитаете ли вы чтение книг встречам с людьми?",
            Yes: {
                ext: 0,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 1,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Верно ли, что вас легко задеть?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Любите ли вы часто бывать в компании?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Бывают ли у вас такие мысли, которыми вам не хотелось делиться с другими людьми?",
            Yes: {
                ext: 0,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 1
            }
        },
        {
            question: "Верно ли, что иногда вы настолько полны энергии, что все горит в руках, а иногда вы чувствуете сильную вялость?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Стараетесь ли вы ограничить круг своих знакомств небольшим числом самых близких людей?",
            Yes: {
                ext: 0,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 1,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Много ли вы мечтаете?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Когда на вас кричат, отвечаете ли тем же?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Считаете ли вы свои привычки хорошими?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Часто ли у вас появляется чувство, что вы чем-то виноваты?",
            Yes: {
                ext: 0,
                neur: 0,
                lies: 1
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Способны ли вы иногда дать волю своим чувств и беззаботно развлечься с веселой компанией?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Можно ли сказать, что часто у вас нервы бывают натянуты до предела?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Слывете ли вы за человека веселого и живого?",
            Yes: {
                ext: 1,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "После того, как дело сделано, часто ли вы мысленно возвращаетесь к нему и думаете, что могли бы сделать лучше?",
            Yes: {
                ext: 0,
                neur: 1,
                lies: 0
            },
            No: {
                ext: 0,
                neur: 0,
                lies: 0
            }
        },
        {
            question: "Чувствуете ли вы себя неспокойно, находясь в большой компании?",
            Yes: {
                ext: 0,
                neur: 0,
                lies: 0
            },
            No: {
                ext: 1,
                neur: 0,
                lies: 0
            }
        }
    ]
